TheMasterCoder007/embedded-react/examples/esp32/esp32-s3/main/main.c
/*
 * Copyright 2026 Cory Lamming
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*
 * embedded-react — ESP32-S3 host, Phase 3 (RGB display + GT911 touch).
 *
 * The uploaded-config model (peer to the desktop demo): this firmware brings up the Waveshare 7" RGB
 * panel (board.c) + GT911 touch and the portable QuickJS host core (er_runtime, JS heap in PSRAM),
 * then loads its UI + logic as a config container (app.erpkg) from a dedicated flash partition —
 * memory-mapped and verified (CRC + QuickJS-version), not embedded in the firmware image. The config
 * carries its own assets (images + fonts), so they are NOT compiled in. No config / a corrupt or
 * version-incompatible one paints an on-screen "Couldn't load config" panel and the loop keeps running
 * (so it stays visible), exactly like the desktop. If the panel fails to init, a no-op backend keeps
 * the JS stack running and logging over UART. Built with CONFIG_ER_WIFI, it also runs a WiFi station the
 * app can point at a network, and sets the app's Date.now() over SNTP (network.c).
 *
 * Flash a config to the 'config' partition separately from the firmware (see ../README.md):
 *   parttool.py write_partition --partition-name=config \
 *       --input ../../bridges/quickjs/js/dist/app.erpkg
 *
 * See ../README.md.
 */

#include "board.h"
#include "er_hotreload.h" /* er_hotreload_apply (on-device hot reload) */
#include "er_perf.h"      /* per-frame timing split + resource counters (feeds the overlay) */
#include "er_runtime.h"
#include "er_scene.h"
#include "esp32_lcd_backend.h"
#include "native_renderer.h"
#include "perf_overlay.h"
#include "quickjs.h" /* JSMallocFunctions (PSRAM JS heap) */

#if ER_HOTRELOAD
#include "hotreload_usb.h" /* USB-Serial-JTAG receiver shim (this example's transport) */
#endif

#include "esp_heap_caps.h"
#include "esp_lcd_panel_ops.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#if CONFIG_ER_WIFI
#include "network.h"    /* WiFi station + SNTP: the real time for Date.now() */
#include "network_js.h" /* the app's __erWifi / __erClock */
#endif
#include "freertos/idf_additions.h" /* xTaskCreatePinnedToCoreWithCaps */

#include <stdint.h>
#include <stdio.h>
#include <string.h>

/*----------------------------------------------------------------------------------------------------------------------
 - Constants
 ---------------------------------------------------------------------------------------------------------------------*/

static const char* TAG = "embedded-react";

/* Whole-screen rotation (clockwise): 0 / 90 / 180 / 270. The panel is physically BOARD_LCD_WIDTH ×
   BOARD_LCD_HEIGHT (800×480); for 90/270 the LOGICAL screen the app renders into is the swap (480×800,
   a portrait UI). The backend maps logical→physical at present; touch is remapped by the inverse. */
#ifndef ER_DISPLAY_ROTATION
#define ER_DISPLAY_ROTATION 0
#endif

/* Logical screen the app sizes its root from (`screen` global) — panel size, swapped for 90/270. */
#if (ER_DISPLAY_ROTATION == 90) || (ER_DISPLAY_ROTATION == 270)
#define SCREEN_W BOARD_LCD_HEIGHT
#define SCREEN_H BOARD_LCD_WIDTH
#else
#define SCREEN_W BOARD_LCD_WIDTH
#define SCREEN_H BOARD_LCD_HEIGHT
#endif

/** @brief Remaps a physical (panel) touch point to logical (app) coords by the inverse rotation. */
static void remap_touch(int* x, int* y)
{
    const int px = *x, py = *y;
    switch (ER_DISPLAY_ROTATION)
    {
        case 90:
            *x = py;
            *y = BOARD_LCD_WIDTH - 1 - px;
            break;
        case 180:
            *x = BOARD_LCD_WIDTH - 1 - px;
            *y = BOARD_LCD_HEIGHT - 1 - py;
            break;
        case 270:
            *x = BOARD_LCD_HEIGHT - 1 - py;
            *y = px;
            break;
        default:
            break;
    }
}

/* QuickJS stack-overflow guard: three quarters of the main task stack (CONFIG_ESP_MAIN_TASK_STACK_SIZE),
   so deep React/QuickJS recursion is caught before it corrupts the FreeRTOS task stack. The last quarter
   holds what run_app has already used and the C frames under the deepest JS call. The default build's
   64 KB stack gives 48 KB; the WiFi build's smaller one scales it down. Raise the task stack if you hit
   "stack overflow" from JS. */
#define ER_JS_MAX_STACK (CONFIG_ESP_MAIN_TASK_STACK_SIZE / 4 * 3)

/* Hard cap on the JS heap (all of it lives in PSRAM via er_js_mf). A runaway app fails with a JS
   out-of-memory error — caught and shown by the error overlay — instead of exhausting the PSRAM the
   framebuffers and engine pools share. */
#define ER_JS_MEMORY_LIMIT (4u * 1024u * 1024u)

/* Floor under QuickJS's automatic GC (0 = leave its own schedule alone). QuickJS re-derives its trigger
 * from the live set after every collection, so on a 4 MB PSRAM arena with a small live set it
 * mark-sweeps the whole object graph over the octal-SPI bus far more often than it needs to. Raising
 * this trades a higher peak heap for fewer pauses; keep it well under ER_JS_MEMORY_LIMIT. Measure
 * before setting it — the RST/PKR overlay lines show whether GC pauses are what you are actually
 * seeing. */
#define ER_JS_GC_THRESHOLD 0u

/* Label of the data partition the config container (app.erpkg) is flashed into (see partitions.csv). */
#define ER_CONFIG_PARTITION_LABEL "config"

/* On-device hot reload over USB-Serial-JTAG. DEV-ONLY and OFF by default — the standard dev workflow is
 * the web simulator (`npx embedded-react dev`); a project opts a board in by building with ER_HOTRELOAD=1
 * (see CMakeLists). ER_HOTRELOAD_MAX_BYTES sizes the single PSRAM staging buffer — the largest hot-reload
 * frame the device accepts in one upload. With the vendor/app split, an edit ships only the APP frame (app
 * bytecode + its assets). A vendor change (rare — a new dependency) is delivered by re-flashing the config
 * partition, not over hot reload. Raise this only if an app's bytecode + assets outgrow it. */
#ifndef ER_HOTRELOAD
#define ER_HOTRELOAD 0
#endif
#ifndef ER_HOTRELOAD_MAX_BYTES
#define ER_HOTRELOAD_MAX_BYTES (512 * 1024)
#endif

/*----------------------------------------------------------------------------------------------------------------------
 - QuickJS heap → PSRAM
 ---------------------------------------------------------------------------------------------------------------------*/

/** @brief PSRAM-backed calloc for the JS heap. */
static void* er_js_calloc(void* opaque, size_t count, size_t size)
{
    (void)opaque;
    return heap_caps_calloc(count, size, MALLOC_CAP_SPIRAM);
}

