TheMasterCoder007/embedded-react/examples/esp32/esp32-s3/main/main.c
/** @brief PSRAM-backed malloc for the JS heap. */
static void* er_js_malloc(void* opaque, size_t size)
{
    (void)opaque;
    return heap_caps_malloc(size, MALLOC_CAP_SPIRAM);
}

/** @brief Frees a JS-heap allocation. */
static void er_js_free(void* opaque, void* ptr)
{
    (void)opaque;
    heap_caps_free(ptr);
}

/** @brief PSRAM-backed realloc for the JS heap. */
static void* er_js_realloc(void* opaque, void* ptr, size_t size)
{
    (void)opaque;
    return heap_caps_realloc(ptr, size, MALLOC_CAP_SPIRAM);
}

/** @brief Reports the usable size of a JS-heap allocation. */
static size_t er_js_usable_size(const void* ptr)
{
    return heap_caps_get_allocated_size((void*)ptr);
}

static const JSMallocFunctions er_js_mf = {
    .js_calloc = er_js_calloc,
    .js_malloc = er_js_malloc,
    .js_free = er_js_free,
    .js_realloc = er_js_realloc,
    .js_malloc_usable_size = er_js_usable_size,
};

/*----------------------------------------------------------------------------------------------------------------------
 - Host log sink (console.* + runtime errors → UART)
 ---------------------------------------------------------------------------------------------------------------------*/

/** @brief er_runtime log callback: one already-formatted line (console.* and error capture) → UART. */
static void uart_log(const char* line)
{
    ESP_LOGI("js", "%s", line);
}

/*----------------------------------------------------------------------------------------------------------------------
 - No-op render backend (display fallback)
 ---------------------------------------------------------------------------------------------------------------------*/

static void noop_fill(uint32_t argb, int x, int y, int w, int h, void* ctx)
{
    (void)argb;
    (void)x;
    (void)y;
    (void)w;
    (void)h;
    (void)ctx;
}
static void noop_copy(const void* src, int stride, int x, int y, int w, int h, void* ctx)
{
    (void)src;
    (void)stride;
    (void)x;
    (void)y;
    (void)w;
    (void)h;
    (void)ctx;
}
static void noop_blend(const void* src, int stride, uint8_t alpha, int x, int y, int w, int h, void* ctx)
{
    (void)src;
    (void)stride;
    (void)alpha;
    (void)x;
    (void)y;
    (void)w;
    (void)h;
    (void)ctx;
}

static const EmbeddedRenderBackend k_noop_backend = {
    noop_fill,
    noop_copy,
    noop_blend,
    NULL,
    NULL,
    NULL, /* fill / copy / blend / wait / frame_ready / ctx */
    0,    /* band_height: 0 = classic full-framebuffer path */
    NULL,
    NULL, /* band_begin / band_flush (unused without banding) */
    NULL  /* copy_rect_fmt (headless: nothing to blit into) */
};

/*----------------------------------------------------------------------------------------------------------------------
 - App
 ---------------------------------------------------------------------------------------------------------------------*/

/** @brief Returns milliseconds since boot (engine-clock delta source). */
static uint32_t now_ms(void)
{
    return (uint32_t)(esp_timer_get_time() / 1000);
}

#if ER_PERF_OVERLAY
/*----------------------------------------------------------------------------------------------------------------------
 - Performance overlay metrics (gathered host-side; ER_PERF_OVERLAY only)
 ---------------------------------------------------------------------------------------------------------------------*/

/* Engine frame diagnostics on the overlay (timing split + resource counters, er_perf.h) — a debugging
 * aid, OFF by default: the everyday overlay is just the four host lines below. Build with
 * `idf.py -DER_PERF_DETAIL=1` to append the engine's lines; the same switch compiles the engine's
 * per-frame instrumentation in (components/engine/CMakeLists.txt keys ER_PERF_STATS off it), so the
 * default build also pays none of its cost. */
#ifndef ER_PERF_DETAIL
#define ER_PERF_DETAIL 0
#endif

/** @brief Lines this host formats itself (FPS / CPU / PSRAM / IRAM); ER_PERF_DETAIL appends the engine's. */
#define PERF_HOST_LINES 4

static char s_perf_buf[PERF_HOST_LINES][24];
/* Host lines first, then the engine's frame-instrumentation lines (timing split + resource counters,
 * er_perf_overlay_lines) — those point into engine-owned static storage, so they are not copied. */
static const char* s_perf_lines[PERF_HOST_LINES + ER_PERF_OVERLAY_LINES];
static int s_perf_nlines = 0;
static uint32_t s_perf_busy_us = 0; /* the previous frame's full work time (pump+commit+present) */

/**
 * @brief Accumulates frame stats and refreshes the overlay text ~twice a second.
 *
 * CPU load is the share of wall-clock the loop spends working vs. idling in vTaskDelay (LVGL-style),
 * averaged over the window. Returns true only on the frame the text changed, so the caller redraws
 * the panel then and leaves it persistent (and the per-frame flush tight) the rest of the time.
 *
 * @param[in] frame_start_us  esp_timer timestamp captured at the top of this frame.
 *
 * @return true when the displayed metrics were just updated.
 */
static bool perf_overlay_refresh(int64_t frame_start_us)
{
    static int64_t window_start = 0;
    static uint32_t frames = 0;
    static uint64_t busy_sum = 0;

    if (window_start == 0)
    {
        window_start = frame_start_us;
    }
    frames++;
    busy_sum += s_perf_busy_us;

    const int64_t elapsed = frame_start_us - window_start;
    if (elapsed < 500000)
    {
        return false;
    }

    const uint32_t fps = (uint32_t)((uint64_t)frames * 1000000ULL / (uint64_t)elapsed);
    uint32_t cpu = (uint32_t)(busy_sum * 100ULL / (uint64_t)elapsed);
    if (cpu > 100U)
    {
        cpu = 100U;
    }
    const uint32_t spiram_k = (uint32_t)(heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024U);
    const uint32_t iram_k = (uint32_t)(heap_caps_get_free_size(MALLOC_CAP_INTERNAL) / 1024U);
    snprintf(s_perf_buf[0], sizeof(s_perf_buf[0]), "FPS %u", (unsigned)fps);
    snprintf(s_perf_buf[1], sizeof(s_perf_buf[1]), "CPU %u%%", (unsigned)cpu);
    snprintf(s_perf_buf[2], sizeof(s_perf_buf[2]), "PSRAM %uK", (unsigned)spiram_k);
    snprintf(s_perf_buf[3], sizeof(s_perf_buf[3]), "IRAM %uK", (unsigned)iram_k);
    for (int i = 0; i < PERF_HOST_LINES; i++)
    {
        s_perf_lines[i] = s_perf_buf[i];
    }
#if ER_PERF_DETAIL
    /* Append the engine's split + counters. This runs before this frame's er_perf_frame_end(), so the
     * numbers are the previous frame's — irrelevant at a 500 ms refresh, and the retained peak (the
     * "PK" lines, which is what a spike hunt actually reads) is unaffected either way. */
    s_perf_nlines = PERF_HOST_LINES + er_perf_overlay_lines(&s_perf_lines[PERF_HOST_LINES], ER_PERF_OVERLAY_LINES);
#else
    s_perf_nlines = PERF_HOST_LINES;
#endif

    frames = 0;
    busy_sum = 0;
    window_start = frame_start_us;
    return true;
}
#endif

