TheMasterCoder007/embedded-react/examples/esp32/esp32-s3/main/main.c
/** @brief Microsecond clock for the engine's instrumentation (er_perf.h, and the temporary ER_PROF probes). */
uint32_t er_prof_now_us(void)
{
    return (uint32_t)esp_timer_get_time();
}

/* Target frame period for the adaptive pacer (~50 fps, just above the RGB panel's ~51 Hz refresh).
 * Light frames sleep the remainder up to this; heavy frames yield the minimum and run as fast as the
 * work allows. The real win needs fine ticks — see CONFIG_FREERTOS_HZ=1000 in sdkconfig.defaults. */
#define ER_TARGET_FRAME_MS 20U

/**
 * @brief Memory-maps the 'config' partition and loads the container it holds via er_runtime.
 *
 * The mapping is kept for the process lifetime — the container's image pixels / font bitmaps are
 * referenced in place from flash, never copied. The partition size is an upper bound; the loader walks
 * the container to find its true length and verifies its CRC + QuickJS version.
 *
 * @param[out] out_status  Receives the load status (valid only when the partition was found + mapped).
 *
 * @return true if the 'config' partition exists and was mapped (then *out_status holds the result);
 *         false if there is no config partition / it could not be mapped.
 */
static bool load_config_partition(ErContainerStatus* out_status)
{
    const esp_partition_t* part =
        esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, ER_CONFIG_PARTITION_LABEL);
    if (!part)
    {
        ESP_LOGE(TAG, "no '%s' partition — add it to partitions.csv", ER_CONFIG_PARTITION_LABEL);
        return false;
    }
    const void* mapped = NULL;
    esp_partition_mmap_handle_t handle;
    const esp_err_t err = esp_partition_mmap(part, 0, part->size, ESP_PARTITION_MMAP_DATA, &mapped, &handle);
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "mmap '%s' failed: %s", ER_CONFIG_PARTITION_LABEL, esp_err_to_name(err));
        return false;
    }
    ESP_LOGI(TAG, "config partition mapped (%u bytes) — loading container", (unsigned)part->size);
    *out_status = er_runtime_load_container(mapped, part->size); /* mapping kept for the process */
    return true;
}

#if ERUI_RENDER_WORKERS > 1
/*----------------------------------------------------------------------------------------------------------------------
 - Multi-core rendering: worker 1 on CPU core 1
 ---------------------------------------------------------------------------------------------------------------------*/

/* The engine never creates threads — this example provides render worker 1 as a FreeRTOS task
 * pinned to core 1 (the main/render task is pinned to core 0 by ESP-IDF's default main-task
 * affinity, so xPortGetCoreID doubles as the worker id). The engine forks each commit's render
 * into horizontal slices across both cores; see EmbeddedRenderWorkers in native_renderer.h. */
static TaskHandle_t s_render_worker;
static SemaphoreHandle_t s_render_worker_done;

/* Where the worker's stack lives. A WiFi build puts it in PSRAM, which frees the 24 KB of internal RAM WiFi
   is otherwise short of; the worker never touches flash, so a PSRAM stack is safe for it. */
#if CONFIG_ER_WIFI
#define ER_WORKER_STACK_CAPS MALLOC_CAP_SPIRAM
#else
#define ER_WORKER_STACK_CAPS (MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)
#endif

static void render_worker_main(void* arg)
{
    (void)arg;
    for (;;)
    {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        er_render_worker_exec(1);
        xSemaphoreGive(s_render_worker_done);
    }
}

static void render_worker_dispatch(int worker, void* ctx)
{
    (void)worker; /* only worker 1 exists */
    (void)ctx;
    xTaskNotifyGive(s_render_worker);
}

static void render_worker_sync(void* ctx)
{
    (void)ctx;
    xSemaphoreTake(s_render_worker_done, portMAX_DELAY);
}

static int render_worker_id(void)
{
    return xPortGetCoreID(); /* workers are core-pinned: core id == worker id */
}

/** @brief Spawns the core-1 render worker and hands it to the engine. */
static void install_render_workers(void)
{
    static const EmbeddedRenderWorkers workers = {
        .count = 2,
        .dispatch = render_worker_dispatch,
        .sync = render_worker_sync,
        .worker_id = render_worker_id,
        .ctx = NULL,
    };
    /* 24 KB: the worker runs the full render recursion (nested composites + transform emits with
     * their on-stack column arrays) but never QuickJS, so it needs render-depth headroom only —
     * 12 KB measurably overflowed on the banded-fade pages. */
    s_render_worker_done = xSemaphoreCreateBinary();
    if (!s_render_worker_done
        || xTaskCreatePinnedToCoreWithCaps(
               render_worker_main, "er_worker", 24576, NULL, 5, &s_render_worker, 1, ER_WORKER_STACK_CAPS)
               != pdPASS)
    {
        if (s_render_worker_done)
        {
            vSemaphoreDelete(s_render_worker_done);
            s_render_worker_done = NULL;
        }
        ESP_LOGW(TAG, "render worker creation failed — rendering stays single-core");
        return;
    }
    embedded_renderer_set_workers(&workers);
    ESP_LOGI(TAG, "multi-core rendering: worker 1 pinned to core 1");
}
#endif /* ERUI_RENDER_WORKERS > 1 */

/**
 * @brief Boots the engine + er_runtime, loads the config from flash, then drives the frame loop.
 */
/** @brief Display verdict, re-logged from the frame loop once the USB console is back. */
static const char* s_display_report = NULL;
static char s_display_report_buf[192];

static void run_app(void)
{
    er_perf_set_clock(er_prof_now_us); /* frame instrumentation clock; no-op when ER_PERF_STATS is off */

    /* Bring up the RGB panel and draw to it; fall back to the no-op backend if it fails so the JS
       stack still runs (and logs why) over UART. */
    esp_lcd_panel_handle_t panel = NULL;
    const bool panel_up = board_display_init(&panel);
    const bool display = panel_up && er_esp32_lcd_backend_init(panel, SCREEN_W, SCREEN_H, ER_DISPLAY_ROTATION);
    if (display)
    {
        ESP_LOGI(TAG, "display backend active");
    }
    else
    {
        ESP_LOGW(TAG, "display init failed — falling back to no-op backend (headless)");
        embedded_renderer_set_backend(&k_noop_backend);
        if (panel_up)
        {
            /* The panel came up and the backend refused it. The panel object owns the internal DMA
               bounce buffers this board has to fight for, and the backend frees nothing on its way
               out, so nothing would ever release them. We created it, so we release it. */
            esp_lcd_panel_del(panel);
            panel = NULL;
        }
    }
    /* Nothing above this point reaches the console: bring-up flips the CH422G's USB_SEL mux and the
       native-USB CDC is re-enumerating for about a second. Repeat the verdict from the frame loop,
       where the console is back. */
    if (display)
    {
        snprintf(s_display_report_buf,
                 sizeof(s_display_report_buf),
                 "backend active%s%s",
                 board_display_last_note()[0] ? ", " : "",
                 board_display_last_note());
    }
    else if (panel_up)
    {
        /* The panel came up — the renderer backend refused it, so the board layer has no error to
           report and asking it for one would say "no reason latched" about the wrong subsystem.
           Past tense on purpose: this line prints from the frame loop, seconds after the handle was
           deleted above, so saying the panel "is up" would send a reader looking for a live one. */
        snprintf(s_display_report_buf,
                 sizeof(s_display_report_buf),
                 "panel init succeeded (%s) but the renderer backend failed to attach; panel released",
                 board_display_last_note()[0] ? board_display_last_note() : "no note");
    }
    else
    {
        snprintf(s_display_report_buf,
                 sizeof(s_display_report_buf),
                 "%s",
                 board_display_last_error()[0] ? board_display_last_error() : "init failed (no reason latched)");
    }
    s_display_report = s_display_report_buf;

#if ERUI_RENDER_WORKERS > 1
    /* Fork render passes across both CPU cores (after display init so its heap needs come first). */
    install_render_workers();
#endif

    /* No baked assets are compiled in: the config container carries its own images + fonts and they
       are registered when it loads (er_runtime_load_container) — just like the desktop demo. */

