TheMasterCoder007/embedded-react/examples/esp32/esp32-s3/main/main.c
    /* Bring up touch (shares the panel's I2C bus). Optional: the UI still renders without it. */
    const bool touch = display && board_touch_init();
    if (display && !touch)
    {
        ESP_LOGW(TAG, "touch init failed — display works but input is disabled");
    }

    /* Boot the portable QuickJS host core with the JS heap in PSRAM and the stack guard set. */
    const ErRuntimeConfig rt_cfg = {
        .screen_width = SCREEN_W,
        .screen_height = SCREEN_H,
        .screen_scale = 1.0f,
        /* With hot reload wired (Phase 4), install the persist store so usePersistentState survives a
           live reload — the same behavior as the desktop simulator. Off when hot reload is compiled out. */
        .install_persist = (ER_HOTRELOAD != 0),
        .log = uart_log,
        .malloc_functions = &er_js_mf, /* JS heap → PSRAM */
        .max_stack_size = ER_JS_MAX_STACK,
        .memory_limit = ER_JS_MEMORY_LIMIT,
        .gc_threshold = ER_JS_GC_THRESHOLD,
#if CONFIG_ER_WIFI
        .install_host_globals = network_js_install, /* __erWifi / __erClock, on every context */
#endif
    };
    if (!er_runtime_init(&rt_cfg))
    {
        ESP_LOGE(TAG, "er_runtime_init failed (PSRAM exhausted?)");
        return;
    }

#if ER_HOTRELOAD
    /* Bring up the hot-reload receiver: `embedded-react dev --device <port>` streams a fresh app.erpkg
       over USB-Serial-JTAG on every save and the frame loop swaps it in live (see below). Non-fatal if
       it can't start — the flashed config still runs. */
    const bool hot_reload = er_hotreload_usb_start(ER_HOTRELOAD_MAX_BYTES);
    if (!hot_reload)
    {
        ESP_LOGW(TAG, "hot reload unavailable — running the flashed config only");
    }
#endif

    /* Load the UI + logic from the config partition. On any failure, paint the on-screen panel and
       keep going — the loop below presents it and feeds the watchdog (firmware doesn't halt because a
       config is missing/bad, mirroring the desktop demo). */
    ErContainerStatus cfg_status = ER_CONTAINER_LOAD_FAILED;
    if (!load_config_partition(&cfg_status))
    {
        er_runtime_show_message("No config loaded",
                                "No config partition was found or it could not be mapped.",
                                "Flash an app.erpkg to the 'config' partition, then reboot.");
    }
    else if (cfg_status != ER_CONTAINER_OK)
    {
        const char* reason = er_runtime_container_status_str(cfg_status);
        ESP_LOGE(TAG, "config rejected: %s", reason);
        er_runtime_show_message("Couldn't load config", reason, "Re-pack with `npm run pack` and re-flash the config.");
    }
    else
    {
        ESP_LOGI(TAG, "config loaded");
    }

    /* Prove layout + paint ran by reporting the painted region of the first commit. */
    er_commit();
    if (display)
    {
        er_esp32_lcd_present(); /* push the mount's paint to the panel (engine doesn't auto-present) */
    }
    ERRect dirty = {0, 0, 0, 0};
    const bool painted = er_get_dirty_rect(&dirty);
    ESP_LOGI(TAG, "first commit painted=%d dirty=%d,%d %dx%d", (int)painted, dirty.x, dirty.y, dirty.w, dirty.h);
    ESP_LOGI(TAG,
             "free PSRAM after boot: %u, free internal: %u",
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));

#if CONFIG_ER_WIFI
    /* Last, so the panel and the app have had their internal RAM: Wi-Fi runs on what is left. */
    const size_t int_before_wifi = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
    if (network_start())
    {
        ESP_LOGI(TAG,
                 "wifi up: free internal %u -> %u, free PSRAM %u",
                 (unsigned)int_before_wifi,
                 (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                 (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    }
#endif

    /* Frame loop: poll touch, pump JS (promises + timers), commit, present, advance animations. */
    uint32_t prev = now_ms();
    uint32_t frame = 0;
    bool touch_down = false; /* press state machine: turns GT911 snapshots into down/move/up */
    int touch_x = 0;
    int touch_y = 0;
    while (true)
    {
        /* Forward touch to the engine before pumping so a press lands in the same frame's render. */
        if (touch)
        {
            int tx = 0;
            int ty = 0;
            bool pressed = false;
            if (board_touch_read(&tx, &ty, &pressed))
            {
                remap_touch(&tx, &ty); /* physical panel coords -> logical (rotated) app coords */
                if (pressed)
                {
                    embedded_renderer_touch(0, touch_down ? ER_TOUCH_MOVE : ER_TOUCH_DOWN, tx, ty);
                    touch_down = true;
                    touch_x = tx;
                    touch_y = ty;
                }
                else if (touch_down)
                {
                    embedded_renderer_touch(0, ER_TOUCH_UP, touch_x, touch_y);
                    touch_down = false;
                }
            }
        }

#if ER_HOTRELOAD
        /* Load a freshly received container, if one is ready, on THIS task (the runtime owner) so the
           reset/load never races the RX task. The old app keeps running until this swaps it in — no
           teardown beforehand. No-op on frames with nothing pending. */
        er_hotreload_usb_pump();
#endif

#if CONFIG_ER_WIFI
        /* Saves a network that just connected; on an NTP sync, anchors Date.now() to it, here on the task
           that owns the runtime. */
        int64_t epoch_ms = 0;
        if (network_poll(&epoch_ms))
        {
            er_runtime_set_wall_clock(epoch_ms);
        }
#endif

        const int64_t frame_start_us = esp_timer_get_time();
        er_perf_frame_begin(); /* frame instrumentation: JS/layout/raster/present split (er_perf.h) */
        er_perf_phase_begin(ER_PERF_PHASE_JS);
        er_runtime_pump(); /* drain JS promises + fire due timers */
        er_perf_phase_end(ER_PERF_PHASE_JS);
        const int64_t t_pump_us = esp_timer_get_time();
        er_commit(); /* lay out (if needed) + paint the changed region into the backend; times itself */
        const int64_t t_commit_us = esp_timer_get_time();
#if ER_PERF_OVERLAY
        /* Render the overlay text only when the metrics change (~twice a second; glyph rendering is the
           expensive part) and snapshot that region. The backend then re-composites the snapshot on top
           of EVERY present (a cheap RGB565 copy), so the overlay stays flicker-free over the
           double-buffered panel without per-frame text rendering, and as its own tight region so it
           never enlarges the app's per-frame dirty box. */
        if (display && perf_overlay_refresh(frame_start_us))
        {
            int ox = 0, oy = 0, ow = 0, oh = 0;
            er_esp32_lcd_overlay_begin(); /* save the app dirty box; capture restores it */
            er_perf_overlay_draw(SCREEN_W, SCREEN_H, s_perf_lines, s_perf_nlines, &ox, &oy, &ow, &oh);
            er_esp32_lcd_overlay_capture(ox, oy, ow, oh);
        }
#endif
        if (display)
        {
            er_perf_phase_begin(ER_PERF_PHASE_PRESENT);
            er_esp32_lcd_present(); /* flush the app region + re-composite the overlay */
            er_perf_phase_end(ER_PERF_PHASE_PRESENT);
        }
        const int64_t t_present_us = esp_timer_get_time();

        const uint32_t now = now_ms();
        embedded_renderer_tick(now - prev);
        prev = now;

        /* Close the frame BEFORE the pacing sleep, so frame_us is work time — the same basis as the
         * CPU-load metric, and the number a frame budget is actually measured against. */
        er_perf_frame_end();

        /* Frame-phase trace: where the frame time goes, averaged over the log window. */
        static uint32_t s_tr_pump = 0, s_tr_commit = 0, s_tr_present = 0, s_tr_n = 0;
        s_tr_pump += (uint32_t)(t_pump_us - frame_start_us);
        s_tr_commit += (uint32_t)(t_commit_us - t_pump_us);
        s_tr_present += (uint32_t)(t_present_us - t_commit_us);
        s_tr_n++;

