TheMasterCoder007/embedded-react/examples/esp32/esp32-s3/main/main.c
#if ER_PERF_DETAIL
        /* The JS split over the wire, so a drag can be read without a camera on the panel. Averaged
           over the frames React actually re-rendered on — every frame runs the pump, so folding the
           idle ones in would divide an interaction's cost by however long the window was quiet. */
        static uint32_t s_js_sum[ER_PERF_JS_COUNT] = {0};
        static uint32_t s_js_n = 0;
        ERPerfFrame pf;
        if (er_perf_get_last(&pf) && (pf.js_us[ER_PERF_JS_RECONCILE] + pf.js_us[ER_PERF_JS_MARSHAL]) > 0U)
        {
            for (int i = 0; i < (int)ER_PERF_JS_COUNT; i++)
            {
                s_js_sum[i] += pf.js_us[i];
            }
            s_js_n++;
        }
#endif

        if ((++frame % 30U) == 0U)
        {
            if (s_display_report)
            {
                ESP_LOGI(TAG, "display: %s", s_display_report);
                s_display_report = NULL; /* once is enough */
            }
#if defined(CONFIG_IDF_TARGET_ESP32S3)
            static int s_pie_diag_logged = 0;
            if (!s_pie_diag_logged && !er_esp32_lcd_pie_enabled())
            {
                extern const char* er_pie_diag(void);
                const char* diag = er_pie_diag();
                if (diag[0] != '\0')
                {
                    ESP_LOGW(TAG, "PIE self-test diag: %s", diag);
                }
                s_pie_diag_logged = 1;
            }
#endif
            ESP_LOGI(TAG,
                     "alive: %u frames, %u ms uptime | avg us/frame: pump=%u commit=%u present=%u | display=%d "
                     "pie=%d int_free=%u",
                     (unsigned)frame,
                     (unsigned)now,
                     (unsigned)(s_tr_pump / s_tr_n),
                     (unsigned)(s_tr_commit / s_tr_n),
                     (unsigned)(s_tr_present / s_tr_n),
                     (int)display,
                     (int)er_esp32_lcd_pie_enabled(),
                     (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
            s_tr_pump = s_tr_commit = s_tr_present = s_tr_n = 0;
#if ER_PERF_DETAIL
            if (s_js_n)
            {
                ERPerfFrame pk;
                er_perf_get_worst(&pk);
                ESP_LOGI(
                    TAG,
                    "JSS avg over %u render frames (of 30): D=%u R=%u M=%u C=%u us | peak frame: D=%u R=%u M=%u C=%u",
                    (unsigned)s_js_n,
                    (unsigned)(s_js_sum[ER_PERF_JS_DISPATCH] / s_js_n),
                    (unsigned)(s_js_sum[ER_PERF_JS_RECONCILE] / s_js_n),
                    (unsigned)(s_js_sum[ER_PERF_JS_MARSHAL] / s_js_n),
                    (unsigned)(s_js_sum[ER_PERF_JS_COMMIT] / s_js_n),
                    (unsigned)pk.js_us[ER_PERF_JS_DISPATCH],
                    (unsigned)pk.js_us[ER_PERF_JS_RECONCILE],
                    (unsigned)pk.js_us[ER_PERF_JS_MARSHAL],
                    (unsigned)pk.js_us[ER_PERF_JS_COMMIT]);
                memset(s_js_sum, 0, sizeof(s_js_sum));
                s_js_n = 0;
            }
#endif
        }

        /* Adaptive pacing: sleep only the remainder up to ER_TARGET_FRAME_MS so heavy frames are not
           taxed by a fixed delay (the old fixed 16 ms was ~10 ms at 100 Hz ticks — pure overhead on a
           30 ms frame). Always block at least one tick so the idle task runs (watchdog); that floor is
           10 ms at 100 Hz but 1 ms at 1000 Hz, which is why sdkconfig.defaults sets CONFIG_FREERTOS_HZ. */
        const uint32_t used_ms = (uint32_t)((esp_timer_get_time() - frame_start_us) / 1000);
#if ER_PERF_OVERLAY
        s_perf_busy_us = used_ms * 1000U; /* work time (excl. sleep) for the CPU-load metric */
#endif
        const uint32_t sleep_ms = (used_ms >= ER_TARGET_FRAME_MS) ? 0U : (ER_TARGET_FRAME_MS - used_ms);
        TickType_t sleep_ticks = pdMS_TO_TICKS(sleep_ms);
        if (sleep_ticks == 0U)
        {
            sleep_ticks = 1U; /* always yield >= 1 tick so the idle task is fed */
        }
        vTaskDelay(sleep_ticks);
    }
}

/** @brief IDF entry point. */
void app_main(void)
{
    ESP_LOGI(TAG, "embedded-react ESP32-S3 host — Phase 2 (RGB display)");
    ESP_LOGI(TAG,
             "PSRAM free: %u bytes, internal free: %u bytes",
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));

    if (heap_caps_get_free_size(MALLOC_CAP_SPIRAM) == 0)
    {
        ESP_LOGE(TAG, "no PSRAM detected — check CONFIG_SPIRAM in sdkconfig.defaults");
        return;
    }

    run_app();
}
